adds mermaid charts
